In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
print(df)
#      A      B  C   D
# 0  foo    one  0   0
# 1  bar    one  1   2
# 2  foo    two  2   4
# 3  bar  three  3   6
# 4  foo    two  4   8
# 5  bar    two  5  10
# 6  foo    one  6  12
# 7  foo  three  7  14

#print(df.loc[df['A'] == 'foo'])

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [2]:
sum_df = df.groupby(['A', 'B'], as_index=False)['D'].sum()

In [3]:
grouped = df.groupby(['A', 'B'])

In [10]:
grouped.first()

           C   D
A   B
bar one    1   2
    three  3   6
    two    5  10
foo one    0   0
    three  7  14
    two    2   4

In [14]:
grouped.sum().reset_index()

     A      B  C   D
0  bar    one  1   2
1  bar  three  3   6
2  bar    two  5  10
3  foo    one  6  12
4  foo  three  7  14
5  foo    two  6  12

In [24]:
type(sum_df)

pandas.core.frame.DataFrame

In [33]:
ns = [1, 2, 3, 4, 5]
result = []
for n in ns:
    if n % 2 == 1:
        result.append(n*2)

In [34]:
result

[2, 6, 10]

In [35]:
r2 = [n*2 for n in ns if n % 2 == 1]

In [36]:
r2

[2, 6, 10]